
N1 = 0
N2 = 0

set1 = set()
set2 = set()


while not (1 <= N1 and N1 <= 100000):
    N1 = int(input("Введите количество чисел первого списка в интервале 1 ≤ N ≤ 100000: ")) 

# Ввод элементов первого списка
for i in range(N1):
    num = int(input("Введите число: "))
    #Для хранения уникальных чисел используем множество
    set1.add(num)

while not (1 <= N2 and N2 <= 100000):
    N2 = int(input("Введите количество чисел второго списка в интервале 1 ≤ N ≤ 100000: "))

# Ввод элементов второго списка
for i in range(N2):
    num = int(input("Введите число: "))
    #Для хранения уникальных чисел используем множество
    set2.add(num)

#Выполним операцию пересечения множеств, в итоге в ыуе1 у нас останутся только числа, которые есть в обоих множествах.
set1.intersection_update(set2)

#Вывод информации о количестве
print(f"Количество чисел, которые содержится одновременно как в первом списке, так и во втором - {len(set1)}")
